#Нечетные числа, воспользуйтесь третим аргументом функции range(), для создания списка нечетных чисел от 1 до 20.
#Выведите все числа в цикле For.
numbers=[]
for i in range(1,20,2):
    number=i
    numbers.append(number)
print(numbers)
#Ответ
#[1, 3, 5, 7, 9, 11, 13, 15, 17, 19]

