#Найдите сумму и произведение элементов списка. Результаты вывести на экран.
print("Enter number: ")
x=int(input())
y=int(input())
print("summa", x+y)
print("Product" , x*y)
# Получилось так.
# Enter number: 
#10
#2
#summa 12
#Product 20

